/*
* Copyright 2021 Web Service Development Inc.
*/
'use strict';

function geolocation_class() {

const toumei = [
{"type":"IC","pname":"東京","lat":35.627931,"lng":139.621146},
{"type":"IC","pname":"東名川崎","lat":35.587378,"lng":139.567641},
{"type":"IC","pname":"横浜青葉","lat":35.542842,"lng":139.539226},
{"type":"IC","pname":"横浜町田","lat":35.508597,"lng":139.484519},
{"type":"IC","pname":"厚木","lat":35.423766,"lng":139.36309},
{"type":"IC","pname":"秦野中井","lat":35.351847,"lng":139.233776},
{"type":"IC","pname":"大井松田","lat":35.343006,"lng":139.157065},
{"type":"EXPASA/SIC","pname":"EXPASA足柄","lat":35.3140516,"lng":138.9617518},
{"type":"IC","pname":"御殿場","lat":35.294707,"lng":138.948791},
{"type":"IC","pname":"裾野","lat":35.222168,"lng":138.90984},
{"type":"IC","pname":"沼津","lat":35.147626,"lng":138.865471},
{"type":"IC","pname":"富士","lat":35.180381,"lng":138.676268},
{"type":"IC","pname":"清水","lat":35.041395,"lng":138.474861},
{"type":"IC","pname":"静岡","lat":34.94728,"lng":138.394046},
{"type":"IC","pname":"焼津","lat":34.881596,"lng":138.299616},
{"type":"IC","pname":"吉田","lat":34.792008,"lng":138.234776},
{"type":"IC","pname":"相良牧之原","lat":34.762147,"lng":138.13907},
{"type":"IC","pname":"菊川","lat":34.750036,"lng":138.08616},
{"type":"IC","pname":"掛川","lat":34.765186,"lng":138.024207},
{"type":"IC","pname":"袋井","lat":34.759895,"lng":137.901217},
{"type":"IC","pname":"磐田","lat":34.749675,"lng":137.860361},
{"type":"IC","pname":"浜松","lat":34.747757,"lng":137.788626},
{"type":"IC","pname":"浜松西","lat":34.765109,"lng":137.679452},
{"type":"IC","pname":"三ヶ日","lat":34.797268,"lng":137.58051},
{"type":"IC","pname":"豊川","lat":34.838499,"lng":137.414192},
{"type":"IC","pname":"音羽蒲郡","lat":34.867416,"lng":137.302768},
{"type":"IC","pname":"岡崎","lat":34.943274,"lng":137.198998},
{"type":"JCT","pname":"豊田","lat":35.021153,"lng":137.147602},
{"type":"IC","pname":"豊田","lat":35.071672,"lng":137.114691},
{"type":"IC","pname":"東名三好","lat":35.11287,"lng":137.095438},
{"type":"JCT","pname":"日進","lat":35.154947,"lng":137.051101},
{"type":"IC","pname":"名古屋","lat":35.17223,"lng":137.022595},
{"type":"IC","pname":"春日井","lat":35.269851,"lng":136.99419},
{"type":"JCT","pname":"小牧","lat":35.284759,"lng":136.97903},
{"type":"IC","pname":"小牧","lat":35.303113,"lng":136.907201}
];

const chuou = [
{"type":"IC","pname":"高井戸","lat":35.679782,"lng":139.607874},
{"type":"IC","pname":"調布","lat":35.661568,"lng":139.535819},
{"type":"IC","pname":"稲城","lat":35.656058,"lng":139.512586},
{"type":"IC","pname":"国立府中","lat":35.672711,"lng":139.440633},
{"type":"IC","pname":"八王子","lat":35.67642,"lng":139.348751},
{"type":"JCT","pname":"八王子","lat":35.640592,"lng":139.255786},
{"type":"IC","pname":"相模湖東","lat":35.621469,"lng":139.195222},
{"type":"IC","pname":"相模湖","lat":35.621198,"lng":139.167219},
{"type":"IC","pname":"上野原","lat":35.621495,"lng":139.117674},
{"type":"IC","pname":"大月","lat":35.60658,"lng":138.926389},
{"type":"JCT","pname":"大月","lat":35.60241,"lng":138.916948},
{"type":"IC","pname":"勝沼","lat":35.652257,"lng":138.737621},
{"type":"IC","pname":"一宮御坂","lat":35.633948,"lng":138.675839},
{"type":"IC","pname":"甲府南","lat":35.600509,"lng":138.588485},
{"type":"IC","pname":"甲府昭和","lat":35.643216,"lng":138.537362},
{"type":"JCT","pname":"双葉","lat":35.689927,"lng":138.496635},
{"type":"IC","pname":"韮崎","lat":35.720254,"lng":138.465103},
{"type":"IC","pname":"須玉","lat":35.7727,"lng":138.423904},
{"type":"IC","pname":"長坂","lat":35.83622,"lng":138.388585},
{"type":"IC","pname":"小淵沢","lat":35.870482,"lng":138.312308},
{"type":"IC","pname":"諏訪南","lat":35.937571,"lng":138.210636},
{"type":"IC","pname":"諏訪","lat":36.003129,"lng":138.128003},
{"type":"JCT","pname":"岡谷","lat":36.052105,"lng":138.043513},
{"type":"IC","pname":"伊北","lat":35.944355,"lng":137.983051},
{"type":"IC","pname":"伊那","lat":35.865743,"lng":137.943327},
{"type":"IC","pname":"駒ヶ根","lat":35.741566,"lng":137.910969},
{"type":"IC","pname":"松川","lat":35.608362,"lng":137.885073},
{"type":"IC","pname":"飯田","lat":35.498972,"lng":137.795227},
{"type":"IC","pname":"園原","lat":35.457646,"lng":137.675933},
{"type":"IC","pname":"中津川","lat":35.474952,"lng":137.485721},
{"type":"IC","pname":"恵那","lat":35.453759,"lng":137.395011},
{"type":"IC","pname":"瑞浪","lat":35.371647,"lng":137.237381},
{"type":"IC","pname":"土岐","lat":35.375039,"lng":137.19251},
{"type":"JCT","pname":"土岐","lat":35.362062,"lng":137.17179},
{"type":"IC","pname":"多治見","lat":35.348408,"lng":137.107932},
{"type":"IC","pname":"小牧東","lat":35.329788,"lng":137.026945},
{"type":"JCT","pname":"小牧","lat":35.284759,"lng":136.97903}
];

const meishin = [
{"type":"IC","pname":"小牧","lat":35.303113,"lng":136.907201},
{"type":"IC","pname":"一宮","lat":35.273732,"lng":136.82799},
{"type":"JCT","pname":"一宮","lat":35.282705,"lng":136.781003},
{"type":"IC","pname":"岐阜羽島","lat":35.307451,"lng":136.691602},
{"type":"IC","pname":"大垣","lat":35.316395,"lng":136.617686},
{"type":"IC","pname":"関ヶ原","lat":35.354004,"lng":136.473209},
{"type":"JCT","pname":"米原","lat":35.317253,"lng":136.321385},
{"type":"IC","pname":"彦根","lat":35.261065,"lng":136.278749},
{"type":"IC","pname":"八日市","lat":35.09241,"lng":136.225748},
{"type":"IC","pname":"竜王","lat":35.053037,"lng":136.101465},
{"type":"IC","pname":"栗東","lat":35.019322,"lng":136.006161},
{"type":"JCT","pname":"草津","lat":34.982929,"lng":135.956433},
{"type":"IC","pname":"草津田上","lat":34.977144,"lng":135.961668},
{"type":"JCT","pname":"瀬田東","lat":34.969832,"lng":135.927889},
{"type":"IC","pname":"瀬田東","lat":34.96845,"lng":135.926875},
{"type":"IC","pname":"瀬田西","lat":34.96921,"lng":135.908689},
{"type":"IC","pname":"大津","lat":34.995735,"lng":135.871385},
{"type":"IC","pname":"京都東","lat":34.988198,"lng":135.836533},
{"type":"IC","pname":"京都南","lat":34.954883,"lng":135.748057},
{"type":"JCT","pname":"大山崎","lat":34.902035,"lng":135.69643},
{"type":"IC","pname":"茨木","lat":34.829362,"lng":135.558457},
{"type":"JCT","pname":"吹田","lat":34.807712,"lng":135.543662},
{"type":"IC","pname":"吹田","lat":34.804475,"lng":135.543732},
{"type":"IC","pname":"豊中","lat":34.753417,"lng":135.464575},
{"type":"IC","pname":"尼崎","lat":34.742424,"lng":135.416778},
{"type":"IC","pname":"西宮","lat":34.726562,"lng":135.35498}
];

const higashimeihan1 = [
{"type":"IC","pname":"名古屋","lat":35.17223,"lng":137.022595},
{"type":"IC","pname":"本郷","lat":35.174054,"lng":137.01561},
{"type":"JCT","pname":"上社","lat":35.171094,"lng":137.00493}
];

const higashimeihan2 = [
{"type":"JCT","pname":"高針","lat":35.147738,"lng":136.999986},
{"type":"JCT","pname":"上社","lat":35.171094,"lng":137.00493},
{"type":"IC","pname":"上社","lat":35.174723,"lng":137.003414},
{"type":"IC","pname":"引山","lat":35.18819,"lng":137.000391},
{"type":"IC","pname":"大森","lat":35.202588,"lng":136.992227},
{"type":"IC","pname":"小幡","lat":35.210305,"lng":136.981962},
{"type":"IC","pname":"松河戸","lat":35.224022,"lng":136.968548},
{"type":"IC","pname":"勝川(1)","lat":35.225297,"lng":136.953592},
{"type":"IC","pname":"勝川(2)","lat":35.228566,"lng":136.939838},
{"type":"IC","pname":"楠","lat":35.229526,"lng":136.917415},
{"type":"JCT","pname":"楠","lat":35.229189,"lng":136.909862},
{"type":"IC","pname":"山田東","lat":35.228036,"lng":136.897797},
{"type":"IC","pname":"山田西","lat":35.22416,"lng":136.886006},
{"type":"IC","pname":"平田","lat":35.222738,"lng":136.868974},
{"type":"IC","pname":"清洲東","lat":35.221678,"lng":136.854962},
{"type":"IC","pname":"清洲西","lat":35.211782,"lng":136.824331},
{"type":"IC","pname":"甚目寺北","lat":35.201806,"lng":136.819353},
{"type":"IC","pname":"甚目寺南","lat":35.18769,"lng":136.816456},
{"type":"IC","pname":"大治北","lat":35.180087,"lng":136.81633},
{"type":"IC","pname":"大治南","lat":35.163924,"lng":136.817282},
{"type":"JCT","pname":"名古屋西","lat":35.158047,"lng":136.818548},
{"type":"IC","pname":"名古屋西","lat":35.155833,"lng":136.808359},
{"type":"IC","pname":"蟹江","lat":35.147231,"lng":136.781105},
{"type":"IC","pname":"弥富","lat":35.12735,"lng":136.729867},
{"type":"IC","pname":"長島","lat":35.111045,"lng":136.695167},
{"type":"IC","pname":"桑名東","lat":35.091032,"lng":136.669428},
{"type":"IC","pname":"桑名","lat":35.065095,"lng":136.646152},
{"type":"JCT","pname":"四日市","lat":35.038412,"lng":136.628573},
{"type":"IC","pname":"四日市東","lat":35.026407,"lng":136.605608},
{"type":"IC","pname":"四日市","lat":34.992384,"lng":136.550046},
{"type":"IC","pname":"鈴鹿","lat":34.931656,"lng":136.488572},
{"type":"IC","pname":"亀山","lat":34.859533,"lng":136.413546},
{"type":"IC","pname":"伊勢関","lat":34.84052,"lng":136.41744}
];

const isewangan = [
{"type":"JCT","pname":"豊田東","lat":35.043841,"lng":137.189069},
{"type":"IC","pname":"豊田東","lat":35.032939,"lng":137.163116},
{"type":"JCT","pname":"豊田","lat":35.021153,"lng":137.147602},
{"type":"IC","pname":"豊田南","lat":35.026517,"lng":137.065859},
{"type":"IC","pname":"豊明(1)","lat":35.039686,"lng":137.007086},
{"type":"IC","pname":"豊明(2)","lat":35.042077,"lng":136.995633},
{"type":"IC","pname":"名古屋南","lat":35.045914,"lng":136.952772},
{"type":"JCT","pname":"名古屋南","lat":35.049972,"lng":136.945481},
{"type":"IC","pname":"大府(1)","lat":35.046876,"lng":136.935562},
{"type":"IC","pname":"大府(2)","lat":35.044873,"lng":136.924158},
{"type":"IC","pname":"東海(1)","lat":35.050323,"lng":136.906493},
{"type":"IC","pname":"東海(2)","lat":35.051873,"lng":136.8935},
{"type":"IC","pname":"名港潮見","lat":35.054368,"lng":136.872804},
{"type":"IC","pname":"名港中央","lat":35.052157,"lng":136.846789},
{"type":"IC","pname":"飛島(1)","lat":35.051873,"lng":136.822067},
{"type":"IC","pname":"飛島(2)","lat":35.05172,"lng":136.808839},
{"type":"IC","pname":"湾岸弥富","lat":35.049939,"lng":136.784063},
{"type":"IC","pname":"弥富木曽岬","lat":35.045205,"lng":136.755989},
{"type":"IC","pname":"湾岸長島","lat":35.033976,"lng":136.730497},
{"type":"IC","pname":"湾岸桑名","lat":35.02471,"lng":136.705845},
{"type":"IC","pname":"みえ川越","lat":35.020578,"lng":136.687203},
{"type":"IC","pname":"みえ朝日","lat":35.02798,"lng":136.647496},
{"type":"JCT","pname":"四日市","lat":35.038412,"lng":136.628573}
];

const jyouban = [
{"type":"JCT","pname":"三郷","lat":35.83709,"lng":139.859243},
{"type":"IC","pname":"流山","lat":35.877861,"lng":139.899452},
{"type":"IC","pname":"柏","lat":35.908815,"lng":139.934809},
{"type":"IC","pname":"谷和原","lat":35.969886,"lng":139.981329},
{"type":"IC","pname":"谷田部","lat":36.02449,"lng":140.080635},
{"type":"JCT","pname":"つくば","lat":36.034863,"lng":140.129113},
{"type":"IC","pname":"桜土浦","lat":36.05699,"lng":140.155345},
{"type":"IC","pname":"土浦北","lat":36.119783,"lng":140.185059},
{"type":"IC","pname":"千代田石岡","lat":36.173725,"lng":140.244851},
{"type":"IC","pname":"岩間","lat":36.282256,"lng":140.319663},
{"type":"JCT","pname":"友部","lat":36.321613,"lng":140.346458},
{"type":"IC","pname":"水戸","lat":36.382281,"lng":140.386286},
{"type":"IC","pname":"那珂","lat":36.453117,"lng":140.474729},
{"type":"IC","pname":"日立南太田","lat":36.508953,"lng":140.575604},
{"type":"IC","pname":"日立中央","lat":36.601485,"lng":140.635713},
{"type":"IC","pname":"日立北","lat":36.651445,"lng":140.669688},
{"type":"IC","pname":"高萩","lat":36.743535,"lng":140.683126},
{"type":"IC","pname":"北茨城","lat":36.797917,"lng":140.724918},
{"type":"IC","pname":"いわき勿来","lat":36.902066,"lng":140.748881},
{"type":"IC","pname":"いわき湯本","lat":37.002626,"lng":140.809418},
{"type":"JCT","pname":"いわき","lat":37.037732,"lng":140.8174},
{"type":"IC","pname":"いわき中央","lat":37.06428,"lng":140.834438},
{"type":"IC","pname":"いわき四倉","lat":37.12704,"lng":140.945334},
{"type":"IC","pname":"広野","lat":37.238298,"lng":140.983735},
{"type":"IC","pname":"常磐富岡","lat":37.374378,"lng":140.966333}
];

const banetsu = [
{"type":"JCT","pname":"いわき","lat":37.037732,"lng":140.8174},
{"type":"IC","pname":"いわき三和","lat":37.102081,"lng":140.769853},
{"type":"IC","pname":"小野","lat":37.290067,"lng":140.612702},
{"type":"IC","pname":"船引三春","lat":37.438488,"lng":140.522266},
{"type":"IC","pname":"郡山東","lat":37.442525,"lng":140.440327},
{"type":"JCT","pname":"郡山","lat":37.466019,"lng":140.35753},
{"type":"IC","pname":"磐越熱海","lat":37.495688,"lng":140.286564},
{"type":"IC","pname":"猪苗代磐梯高原","lat":37.540898,"lng":140.112889},
{"type":"IC","pname":"磐越河東","lat":37.550978,"lng":139.970195},
{"type":"IC","pname":"会津若松","lat":37.526567,"lng":139.91878},
{"type":"IC","pname":"会津坂下","lat":37.562365,"lng":139.76764},
{"type":"IC","pname":"西会津","lat":37.578101,"lng":139.64885},
{"type":"IC","pname":"津川","lat":37.673242,"lng":139.450404},
{"type":"IC","pname":"三川","lat":37.697884,"lng":139.37162},
{"type":"IC","pname":"安田","lat":37.757878,"lng":139.235782},
{"type":"IC","pname":"新津","lat":37.804893,"lng":139.15026},
{"type":"JCT","pname":"新潟中央","lat":37.871955,"lng":139.040415},
{"type":"IC","pname":"新潟中央","lat":37.875243,"lng":139.038312}
];

const touhoku = [
{"type":"JCT","pname":"川口","lat":35.853135,"lng":139.733766},
{"type":"IC","pname":"浦和(1)","lat":35.881053,"lng":139.728713},
{"type":"IC","pname":"浦和(2)","lat":35.892392,"lng":139.720827},
{"type":"IC","pname":"岩槻","lat":35.93725,"lng":139.690915},
{"type":"IC","pname":"久喜","lat":36.061151,"lng":139.653252},
{"type":"IC","pname":"加須","lat":36.127195,"lng":139.62725},
{"type":"IC","pname":"羽生","lat":36.169377,"lng":139.588653},
{"type":"IC","pname":"館林","lat":36.169377,"lng":139.588653},
{"type":"IC","pname":"佐野藤岡","lat":36.292982,"lng":139.61885},
{"type":"IC","pname":"栃木","lat":36.402442,"lng":139.708414},
{"type":"JCT","pname":"栃木都賀","lat":36.424006,"lng":139.719481},
{"type":"IC","pname":"鹿沼","lat":36.540191,"lng":139.799223},
{"type":"IC","pname":"宇都宮","lat":36.631483,"lng":139.845711},
{"type":"IC","pname":"矢板","lat":36.76255,"lng":139.934095},
{"type":"IC","pname":"西那須野塩原","lat":36.916034,"lng":139.943526},
{"type":"IC","pname":"那須","lat":37.005586,"lng":140.039946},
{"type":"IC","pname":"白河","lat":37.117399,"lng":140.16381},
{"type":"IC","pname":"矢吹","lat":37.196014,"lng":140.29762},
{"type":"IC","pname":"須賀川","lat":37.290093,"lng":140.351189},
{"type":"IC","pname":"郡山南","lat":37.366725,"lng":140.311192},
{"type":"IC","pname":"郡山","lat":37.434488,"lng":140.344178},
{"type":"JCT","pname":"郡山","lat":37.466019,"lng":140.35753},
{"type":"IC","pname":"本宮","lat":37.487697,"lng":140.376928},
{"type":"IC","pname":"二本松","lat":37.591587,"lng":140.418674},
{"type":"IC","pname":"福島西","lat":37.737106,"lng":140.420948},
{"type":"IC","pname":"福島飯坂","lat":37.80302,"lng":140.456107},
{"type":"IC","pname":"国見","lat":37.880222,"lng":140.530672},
{"type":"IC","pname":"白石","lat":38.039054,"lng":140.631958},
{"type":"IC","pname":"村田","lat":38.120783,"lng":140.710799},
{"type":"JCT","pname":"村田","lat":38.140329,"lng":140.72319},
{"type":"IC","pname":"仙台南","lat":38.215196,"lng":140.803227},
{"type":"IC","pname":"仙台宮城","lat":38.257976,"lng":140.810845},
{"type":"IC","pname":"泉","lat":38.348131,"lng":140.87495},
{"type":"IC","pname":"大和","lat":38.436144,"lng":140.916159},
{"type":"IC","pname":"古川","lat":38.590464,"lng":140.931603},
{"type":"IC","pname":"築館","lat":38.710387,"lng":141.009532},
{"type":"IC","pname":"若柳金成","lat":38.793405,"lng":141.083883},
{"type":"IC","pname":"一関","lat":38.937406,"lng":141.101285},
{"type":"IC","pname":"平泉前沢","lat":39.021518,"lng":141.111006},
{"type":"IC","pname":"水沢","lat":39.171149,"lng":141.117963},
{"type":"IC","pname":"北上金ヶ崎","lat":39.239882,"lng":141.079259},
{"type":"JCT","pname":"北上","lat":39.274117,"lng":141.076233},
{"type":"IC","pname":"北上江釣子","lat":39.298545,"lng":141.087574},
{"type":"IC","pname":"花巻南","lat":39.386081,"lng":141.091479},
{"type":"JCT","pname":"花巻","lat":39.423216,"lng":141.101178},
{"type":"IC","pname":"花巻","lat":39.445175,"lng":141.109611},
{"type":"IC","pname":"紫波","lat":39.556322,"lng":141.115533},
{"type":"IC","pname":"盛岡南","lat":39.652504,"lng":141.122625},
{"type":"IC","pname":"盛岡","lat":39.710542,"lng":141.095658},
{"type":"IC","pname":"滝沢","lat":39.798068,"lng":141.112175},
{"type":"IC","pname":"西根","lat":39.88366,"lng":141.089312},
{"type":"IC","pname":"松尾八幡平","lat":39.949741,"lng":141.03209},
{"type":"JCT","pname":"安代","lat":40.104435,"lng":141.060419},
{"type":"IC","pname":"安代","lat":40.109381,"lng":141.048454},
{"type":"IC","pname":"鹿角八幡平","lat":40.162264,"lng":140.804408},
{"type":"IC","pname":"十和田","lat":40.255238,"lng":140.766256},
{"type":"IC","pname":"小坂","lat":40.319923,"lng":140.735748},
{"type":"IC","pname":"碇ヶ関","lat":40.466768,"lng":140.635954},
{"type":"IC","pname":"大鰐弘前","lat":40.54791,"lng":140.558288},
{"type":"IC","pname":"黒石","lat":40.622137,"lng":140.61632},
{"type":"IC","pname":"浪岡","lat":40.740486,"lng":140.602995},
{"type":"IC","pname":"青森","lat":40.795874,"lng":140.674471}
];

const akita = [
    {"type":"JCT","pname":"北上","lat":39.274117,"lng":141.076233},
    {"type":"IC","pname":"北上西","lat":39.291785,"lng":140.98447},
    {"type":"IC","pname":"湯田","lat":39.313468,"lng":140.747252},
    {"type":"IC","pname":"横手","lat":39.279324,"lng":140.54661},
    {"type":"IC","pname":"大曲","lat":39.426775,"lng":140.425023},
    {"type":"IC","pname":"西仙北","lat":39.539334,"lng":140.324762},
    {"type":"IC","pname":"協和","lat":39.596233,"lng":140.282844},
    {"type":"JCT","pname":"河辺","lat":39.64024,"lng":140.211312},
    {"type":"IC","pname":"秋田南","lat":39.659902,"lng":140.191332},
    {"type":"IC","pname":"秋田中央","lat":39.722205,"lng":140.181242},
    {"type":"IC","pname":"秋田北","lat":39.781648,"lng":140.112996},
    {"type":"IC","pname":"昭和男鹿半島","lat":39.85907,"lng":140.071255},
    {"type":"IC","pname":"五城目八郎潟","lat":39.948121,"lng":140.096999},
    {"type":"IC","pname":"琴丘森岳","lat":40.033028,"lng":140.088427},
    {"type":"IC","pname":"八竜","lat":40.118109,"lng":140.011324},
    {"type":"IC","pname":"能代南","lat":40.153765,"lng":140.022705}
];

const kanetsu = [
{"type":"IC","pname":"練馬","lat":35.75525,"lng":139.60517},
{"type":"JCT","pname":"大泉","lat":35.758913,"lng":139.598527},
{"type":"IC","pname":"所沢","lat":35.808643,"lng":139.530197},
{"type":"IC","pname":"川越","lat":35.894274,"lng":139.458526},
{"type":"JCT","pname":"鶴ヶ島","lat":35.932099,"lng":139.407341},
{"type":"IC","pname":"鶴ヶ島","lat":35.946453,"lng":139.398136},
{"type":"IC","pname":"東松山","lat":36.02721,"lng":139.381506},
{"type":"IC","pname":"嵐山小川","lat":36.067833,"lng":139.313153},
{"type":"IC","pname":"花園","lat":36.123889,"lng":139.249198},
{"type":"IC","pname":"本庄児玉","lat":36.219098,"lng":139.164087},
{"type":"JCT","pname":"藤岡","lat":36.273168,"lng":139.09436},
{"type":"JCT","pname":"高崎","lat":36.321077,"lng":139.075201},
{"type":"IC","pname":"高崎","lat":36.337599,"lng":139.058955},
{"type":"IC","pname":"前橋","lat":36.375046,"lng":139.027798},
{"type":"IC","pname":"渋川伊香保","lat":36.47523,"lng":139.015251},
{"type":"IC","pname":"赤城","lat":36.536386,"lng":139.048052},
{"type":"IC","pname":"昭和","lat":36.615642,"lng":139.067398},
{"type":"IC","pname":"沼田","lat":36.656981,"lng":139.069898},
{"type":"IC","pname":"月夜野","lat":36.676224,"lng":139.020401},
{"type":"IC","pname":"水上","lat":36.746959,"lng":138.975551},
{"type":"IC","pname":"湯沢","lat":36.933226,"lng":138.828011},
{"type":"IC","pname":"塩沢石打","lat":36.996705,"lng":138.819678},
{"type":"IC","pname":"六日町","lat":37.084274,"lng":138.875459},
{"type":"IC","pname":"小出","lat":37.214143,"lng":138.973819},
{"type":"IC","pname":"堀之内","lat":37.256154,"lng":138.924032},
{"type":"IC","pname":"越後川口","lat":37.269255,"lng":138.83779},
{"type":"IC","pname":"小千谷","lat":37.307021,"lng":138.779404},
{"type":"IC","pname":"長岡","lat":37.446128,"lng":138.788105},
{"type":"JCT","pname":"長岡","lat":37.460774,"lng":138.791399}
];

const chugoku = [
{"type":"JCT","pname":"吹田","lat":34.807712,"lng":135.543662},
{"type":"IC","pname":"中国吹田","lat":34.807095,"lng":135.531608},
{"type":"IC","pname":"中国豊中","lat":34.800924,"lng":135.45516},
{"type":"IC","pname":"中国池田","lat":34.805767,"lng":135.431677},
{"type":"IC","pname":"宝塚","lat":34.806573,"lng":135.368959},
{"type":"JCT","pname":"西宮山口","lat":34.834738,"lng":135.262599},
{"type":"IC","pname":"西宮北","lat":34.83838,"lng":135.235611},
{"type":"JCT","pname":"神戸","lat":34.849364,"lng":135.222967},
{"type":"IC","pname":"神戸三田","lat":34.882107,"lng":135.186751},
{"type":"JCT","pname":"吉川","lat":34.893504,"lng":135.151475},
{"type":"IC","pname":"吉川","lat":34.88994,"lng":135.116888},
{"type":"IC","pname":"ひょうご東条","lat":34.895772,"lng":135.079946},
{"type":"IC","pname":"滝野社","lat":34.930952,"lng":134.963828},
{"type":"IC","pname":"加西","lat":34.934818,"lng":134.866458},
{"type":"IC","pname":"福崎","lat":34.948846,"lng":134.761932},
{"type":"IC","pname":"山崎","lat":34.998794,"lng":134.550666},
{"type":"IC","pname":"佐用","lat":35.022243,"lng":134.369547},
{"type":"IC","pname":"作東","lat":35.015908,"lng":134.24867},
{"type":"IC","pname":"美作","lat":35.026153,"lng":134.162373},
{"type":"IC","pname":"津山","lat":35.026153,"lng":134.162373},
{"type":"IC","pname":"院庄","lat":35.064445,"lng":133.951224},
{"type":"JCT","pname":"落合","lat":35.051199,"lng":133.808002},
{"type":"IC","pname":"落合","lat":35.025254,"lng":133.746909},
{"type":"JCT","pname":"北房","lat":34.984014,"lng":133.683003},
{"type":"IC","pname":"北房","lat":34.97674,"lng":133.659276},
{"type":"IC","pname":"新見","lat":34.998038,"lng":133.447055},
{"type":"IC","pname":"東城","lat":34.887973,"lng":133.278977},
{"type":"IC","pname":"庄原","lat":34.845693,"lng":133.022584},
{"type":"IC","pname":"三次","lat":34.785613,"lng":132.861086},
{"type":"IC","pname":"高田","lat":34.718264,"lng":132.681252},
{"type":"IC","pname":"千代田","lat":34.671595,"lng":132.542268},
{"type":"JCT","pname":"千代田","lat":34.661668,"lng":132.524251},
{"type":"JCT","pname":"広島北","lat":34.573977,"lng":132.456933},
{"type":"IC","pname":"戸河内","lat":34.574918,"lng":132.274087},
{"type":"IC","pname":"吉和","lat":34.48377,"lng":132.153779},
{"type":"IC","pname":"六日市","lat":34.351918,"lng":131.945093},
{"type":"IC","pname":"鹿野","lat":34.234025,"lng":131.809748},
{"type":"IC","pname":"徳地","lat":34.20086,"lng":131.667607},
{"type":"IC","pname":"山口","lat":34.153641,"lng":131.522698},
{"type":"JCT","pname":"山口","lat":34.132144,"lng":131.447623},
{"type":"IC","pname":"小郡","lat":34.126467,"lng":131.403788},
{"type":"IC","pname":"美祢","lat":34.170429,"lng":131.245312},
{"type":"IC","pname":"美祢西","lat":34.108003,"lng":131.142557},
{"type":"JCT","pname":"下関","lat":34.091953,"lng":131.079139},
{"type":"IC","pname":"小月","lat":34.079038,"lng":131.031157},
{"type":"IC","pname":"下関","lat":33.978623,"lng":130.952421}
];

const sanyou1 = [
{"type":"JCT","pname":"神戸","lat":34.849364,"lng":135.222967},
{"type":"IC","pname":"神戸北","lat":34.840141,"lng":135.198462},
{"type":"JCT","pname":"三木","lat":34.811528,"lng":135.075265},
{"type":"IC","pname":"三木東","lat":34.798497,"lng":135.054028},
{"type":"IC","pname":"三木小野","lat":34.812612,"lng":134.957565},
{"type":"IC","pname":"加古川北","lat":34.848827,"lng":134.830787},
{"type":"IC","pname":"山陽姫路東","lat":34.851209,"lng":134.741081},
{"type":"IC","pname":"山陽姫路西","lat":34.868072,"lng":134.61388},
{"type":"IC","pname":"龍野","lat":34.852034,"lng":134.545805},
{"type":"IC","pname":"龍野西","lat":34.833798,"lng":134.505162},
{"type":"JCT","pname":"播磨","lat":34.830177,"lng":134.490297},
{"type":"IC","pname":"赤穂","lat":34.773948,"lng":134.373527},
{"type":"IC","pname":"備前","lat":34.78336,"lng":134.26265},
{"type":"IC","pname":"和気","lat":34.787105,"lng":134.161206},
{"type":"IC","pname":"山陽","lat":34.743089,"lng":134.024416},
{"type":"IC","pname":"岡山","lat":34.701956,"lng":133.887184},
{"type":"JCT","pname":"岡山","lat":34.676874,"lng":133.81879},
{"type":"JCT","pname":"倉敷","lat":34.627086,"lng":133.793473},
{"type":"IC","pname":"倉敷","lat":34.62622,"lng":133.770738},
{"type":"IC","pname":"玉島","lat":34.584354,"lng":133.686613},
{"type":"IC","pname":"鴨方","lat":34.55186,"lng":133.591615},
{"type":"IC","pname":"笠岡","lat":34.535522,"lng":133.512055},
{"type":"IC","pname":"福山東","lat":34.513497,"lng":133.396353},
{"type":"IC","pname":"福山西","lat":34.461578,"lng":133.237869},
{"type":"IC","pname":"尾道","lat":34.462593,"lng":133.177519},
{"type":"IC","pname":"三原久井","lat":34.46348,"lng":133.052448},
{"type":"IC","pname":"本郷","lat":34.430872,"lng":132.955127},
{"type":"IC","pname":"河内","lat":34.429182,"lng":132.871619},
{"type":"IC","pname":"西条","lat":34.441575,"lng":132.754143},
{"type":"IC","pname":"志和","lat":34.460393,"lng":132.645144},
{"type":"IC","pname":"広島東","lat":34.450564,"lng":132.544534},
{"type":"IC","pname":"広島","lat":34.465656,"lng":132.479547},
{"type":"JCT","pname":"広島","lat":34.449155,"lng":132.412274},
{"type":"IC","pname":"五日市","lat":34.429538,"lng":132.391758},
{"type":"JCT","pname":"廿日市","lat":34.33718,"lng":132.294295}
];

const sanyou2 = [
{"type":"IC","pname":"大竹","lat":34.243692,"lng":132.216457},
{"type":"IC","pname":"岩国","lat":34.176381,"lng":132.166589},
{"type":"IC","pname":"玖珂","lat":34.083292,"lng":132.083948},
{"type":"IC","pname":"熊毛","lat":34.035042,"lng":131.971596},
{"type":"IC","pname":"徳山東","lat":34.045668,"lng":131.852409},
{"type":"IC","pname":"徳山西","lat":34.069223,"lng":131.686404},
{"type":"IC","pname":"防府東","lat":34.072231,"lng":131.561987},
{"type":"IC","pname":"防府西","lat":34.056093,"lng":131.537845},
{"type":"IC","pname":"山口南","lat":34.0876,"lng":131.463899},
{"type":"JCT","pname":"山口","lat":34.132144,"lng":131.447623}
];

const sanyou3 = [
{"type":"JCT","pname":"宇部","lat":33.994147,"lng":131.317646},
{"type":"IC","pname":"宇部","lat":33.992228,"lng":131.284685},
{"type":"IC","pname":"小野田","lat":34.023187,"lng":131.186419},
{"type":"IC","pname":"埴生","lat":34.047228,"lng":131.098759},
{"type":"JCT","pname":"下関","lat":34.091953,"lng":131.079139}
];

const sanyou4 = [
{"type":"JCT","pname":"三木","lat":34.811528,"lng":135.075265},
{"type":"IC","pname":"神戸西","lat":34.728067,"lng":135.085667}
];

const sanyou5 = [
{"type":"JCT","pname":"倉敷","lat":34.627086,"lng":133.793473},
{"type":"IC","pname":"早島","lat":34.60068,"lng":133.811406}
];

const yonago = [
{"type":"JCT","pname":"落合","lat":35.051199,"lng":133.808002},
{"type":"IC","pname":"久世","lat":35.071725,"lng":133.792384},
{"type":"IC","pname":"湯原","lat":35.168393,"lng":133.741282},
{"type":"IC","pname":"蒜山","lat":35.271485,"lng":133.617209},
{"type":"IC","pname":"江府","lat":35.271485,"lng":133.617209},
{"type":"IC","pname":"溝口","lat":35.36278,"lng":133.45155},
{"type":"IC","pname":"米子","lat":35.424835,"lng":133.400078},
{"type":"JCT","pname":"米子","lat":35.425792,"lng":133.398584}
];

const kyushu = [
{"type":"IC","pname":"門司","lat":33.924337,"lng":130.982609},
{"type":"IC","pname":"新門司","lat":33.886956,"lng":130.969369},
{"type":"IC","pname":"小倉東","lat":33.832904,"lng":130.910318},
{"type":"JCT","pname":"北九州","lat":33.816237,"lng":130.884976},
{"type":"IC","pname":"小倉南","lat":33.803774,"lng":130.852774},
{"type":"IC","pname":"八幡","lat":33.780289,"lng":130.74239},
{"type":"IC","pname":"若宮","lat":33.747631,"lng":130.609186},
{"type":"IC","pname":"古賀","lat":33.718655,"lng":130.493288},
{"type":"IC","pname":"福岡","lat":33.62915,"lng":130.489463},
{"type":"IC","pname":"太宰府","lat":33.530556,"lng":130.497016},
{"type":"IC","pname":"筑紫野","lat":33.473809,"lng":130.521204},
{"type":"JCT","pname":"鳥栖","lat":33.396515,"lng":130.53851},
{"type":"IC","pname":"久留米","lat":33.317695,"lng":130.557548},
{"type":"IC","pname":"広川","lat":33.255464,"lng":130.537056},
{"type":"IC","pname":"八女","lat":33.21056,"lng":130.523436},
{"type":"IC","pname":"南関","lat":33.071807,"lng":130.545701},
{"type":"IC","pname":"菊水","lat":32.987585,"lng":130.605466},
{"type":"IC","pname":"植木","lat":32.93284,"lng":130.69572},
{"type":"IC","pname":"熊本","lat":32.834369,"lng":130.779501},
{"type":"IC","pname":"益城熊本空港","lat":32.79063,"lng":130.790021},
{"type":"IC","pname":"御船","lat":32.73412,"lng":130.777401},
{"type":"IC","pname":"松橋","lat":32.73412,"lng":130.777401},
{"type":"IC","pname":"八代","lat":32.512784,"lng":130.647821},
{"type":"JCT","pname":"八代","lat":32.505726,"lng":130.64638},
{"type":"IC","pname":"人吉","lat":32.232123,"lng":130.770524},
{"type":"IC","pname":"えびの","lat":32.049962,"lng":130.801356},
{"type":"JCT","pname":"えびの","lat":32.031807,"lng":130.79741},
{"type":"IC","pname":"栗野","lat":31.944365,"lng":130.720643},
{"type":"IC","pname":"横川","lat":31.89767,"lng":130.705091},
{"type":"IC","pname":"溝辺鹿児島空港","lat":31.789812,"lng":130.717641},
{"type":"JCT","pname":"加治木","lat":31.747557,"lng":130.666698},
{"type":"IC","pname":"姶良","lat":31.728872,"lng":130.588686},
{"type":"IC","pname":"薩摩吉田","lat":31.672074,"lng":130.564294},
{"type":"IC","pname":"鹿児島北","lat":31.620333,"lng":130.524085},
{"type":"IC","pname":"鹿児島","lat":31.585998,"lng":130.515266}
];

const ooita1 = [
{"type":"JCT","pname":"鳥栖","lat":33.396515,"lng":130.53851},
{"type":"IC","pname":"筑後小郡","lat":33.40321,"lng":130.590287},
{"type":"IC","pname":"甘木","lat":33.401643,"lng":130.65002},
{"type":"IC","pname":"朝倉","lat":33.381161,"lng":130.726726},
{"type":"IC","pname":"杷木","lat":33.369657,"lng":130.808987},
{"type":"IC","pname":"日田","lat":33.340561,"lng":130.929557},
{"type":"IC","pname":"天瀬高塚","lat":33.295689,"lng":131.051177},
{"type":"IC","pname":"玖珠","lat":33.290124,"lng":131.16424},
{"type":"IC","pname":"九重","lat":33.23237,"lng":131.209223},
{"type":"IC","pname":"湯布院","lat":33.2574,"lng":131.329118},
{"type":"JCT","pname":"日出","lat":33.352102,"lng":131.447489},
{"type":"IC","pname":"別府","lat":33.294705,"lng":131.463443},
{"type":"IC","pname":"大分","lat":33.222579,"lng":131.574057},
{"type":"IC","pname":"大分光吉","lat":33.196928,"lng":131.598347},
{"type":"IC","pname":"大分米良","lat":33.1999,"lng":131.635456}
];

const ooita2 = [
{"type":"JCT","pname":"日出","lat":33.352102,"lng":131.447489},
{"type":"IC","pname":"速見","lat":33.378227,"lng":131.45206}
];

const nagasaki = [
{"type":"IC","pname":"長崎","lat":32.728754,"lng":129.905439},
{"type":"IC","pname":"長崎芒塚","lat":32.751825,"lng":129.927551},
{"type":"IC","pname":"長崎多良見","lat":32.811054,"lng":129.97122},
{"type":"IC","pname":"諫早","lat":32.83315,"lng":130.011746},
{"type":"IC","pname":"大村","lat":32.932322,"lng":129.970512},
{"type":"IC","pname":"東そのぎ","lat":33.036851,"lng":129.926146},
{"type":"IC","pname":"嬉野","lat":33.112087,"lng":129.975107},
{"type":"JCT","pname":"武雄","lat":33.147761,"lng":129.99694},
{"type":"IC","pname":"武雄北方","lat":33.218818,"lng":130.049868},
{"type":"IC","pname":"多久","lat":33.287113,"lng":130.129275},
{"type":"IC","pname":"佐賀大和","lat":33.321629,"lng":130.277896},
{"type":"IC","pname":"東脊振","lat":33.354011,"lng":130.396015},
{"type":"IC","pname":"鳥栖(1)","lat":33.394831,"lng":130.523179},
{"type":"IC","pname":"鳥栖(2)","lat":33.393863,"lng":130.528682},
{"type":"JCT","pname":"鳥栖","lat":33.396515,"lng":130.53851}
];

const miyazaki = [
{"type":"JCT","pname":"えびの","lat":32.031807,"lng":130.79741},
{"type":"IC","pname":"小林","lat":31.984608,"lng":130.932591},
{"type":"IC","pname":"高原","lat":31.929201,"lng":131.01788},
{"type":"IC","pname":"都城","lat":31.782074,"lng":131.115373},
{"type":"IC","pname":"田野","lat":31.821432,"lng":131.302696},
{"type":"JCT","pname":"清武","lat":31.84864,"lng":131.357914},
{"type":"IC","pname":"宮崎","lat":31.870478,"lng":131.41611}
];

const hokuriku = [
{"type":"JCT","pname":"米原","lat":35.317253,"lng":136.321385},
{"type":"IC","pname":"米原","lat":35.323249,"lng":136.319813},
{"type":"IC","pname":"長浜","lat":35.399501,"lng":136.293399},
{"type":"IC","pname":"木之本","lat":35.500653,"lng":136.217535},
{"type":"IC","pname":"敦賀","lat":35.64564,"lng":136.095559},
{"type":"IC","pname":"今庄","lat":35.800105,"lng":136.190726},
{"type":"IC","pname":"武生","lat":35.900962,"lng":136.202525},
{"type":"IC","pname":"鯖江","lat":35.951406,"lng":136.201496},
{"type":"IC","pname":"福井","lat":36.033486,"lng":136.254861},
{"type":"IC","pname":"福井北","lat":36.086312,"lng":136.278877},
{"type":"IC","pname":"丸岡","lat":36.145155,"lng":136.284936},
{"type":"IC","pname":"金津","lat":36.235267,"lng":136.280302},
{"type":"IC","pname":"加賀","lat":36.29207,"lng":136.288069},
{"type":"IC","pname":"片山津","lat":36.37231,"lng":136.358952},
{"type":"IC","pname":"小松","lat":36.42223,"lng":136.430288},
{"type":"IC","pname":"美川","lat":36.503886,"lng":136.497373},
{"type":"IC","pname":"金沢西(1)","lat":36.564007,"lng":136.597323},
{"type":"IC","pname":"金沢西(2)","lat":36.573406,"lng":136.608019},
{"type":"IC","pname":"金沢東","lat":36.60751,"lng":136.675718},
{"type":"IC","pname":"金沢森本","lat":36.606959,"lng":136.70611},
{"type":"IC","pname":"小矢部","lat":36.630136,"lng":136.850091},
{"type":"JCT","pname":"小矢部砺波","lat":36.63051,"lng":136.908531},
{"type":"IC","pname":"砺波","lat":36.623514,"lng":136.952039},
{"type":"IC","pname":"小杉","lat":36.690971,"lng":137.080772},
{"type":"IC","pname":"富山西","lat":36.680567,"lng":137.13238},
{"type":"IC","pname":"富山","lat":36.655088,"lng":137.205994},
{"type":"IC","pname":"立山","lat":36.685183,"lng":137.325038},
{"type":"IC","pname":"滑川","lat":36.74104,"lng":137.379071},
{"type":"IC","pname":"魚津","lat":36.814709,"lng":137.426584},
{"type":"IC","pname":"黒部","lat":36.882418,"lng":137.487043},
{"type":"IC","pname":"朝日","lat":36.939952,"lng":137.550148},
{"type":"IC","pname":"親不知","lat":37.000839,"lng":137.721471},
{"type":"IC","pname":"糸魚川","lat":37.027523,"lng":137.852535},
{"type":"IC","pname":"能生","lat":37.090871,"lng":137.986972},
{"type":"IC","pname":"名立谷浜","lat":37.166464,"lng":138.113106},
{"type":"JCT","pname":"上越","lat":37.140109,"lng":138.2151},
{"type":"IC","pname":"上越","lat":37.150695,"lng":138.261955},
{"type":"IC","pname":"柿崎","lat":37.268668,"lng":138.393},
{"type":"IC","pname":"米山","lat":37.337771,"lng":138.476725},
{"type":"IC","pname":"柏崎","lat":37.360479,"lng":138.592921},
{"type":"IC","pname":"西山","lat":37.441086,"lng":138.658506},
{"type":"JCT","pname":"長岡","lat":37.460774,"lng":138.791399},
{"type":"IC","pname":"中之島見附","lat":37.530323,"lng":138.86976},
{"type":"IC","pname":"三条燕","lat":37.530323,"lng":138.86976},
{"type":"IC","pname":"巻潟東","lat":37.744905,"lng":138.939293},
{"type":"IC","pname":"新潟西","lat":37.86768,"lng":139.005203},
{"type":"JCT","pname":"新潟中央","lat":37.871955,"lng":139.040415}
];

const jyoshinetsu = [
{"type":"JCT","pname":"藤岡","lat":36.273168,"lng":139.09436},
{"type":"IC","pname":"藤岡","lat":36.271728,"lng":139.076038},
{"type":"IC","pname":"吉井","lat":36.243044,"lng":138.991336},
{"type":"IC","pname":"富岡","lat":36.240163,"lng":138.89556},
{"type":"IC","pname":"下仁田","lat":36.235542,"lng":138.823698},
{"type":"IC","pname":"松井田妙義","lat":36.31283,"lng":138.776202},
{"type":"IC","pname":"碓氷軽井沢","lat":36.294128,"lng":138.671794},
{"type":"IC","pname":"佐久","lat":36.287065,"lng":138.483688},
{"type":"IC","pname":"小諸","lat":36.345759,"lng":138.407599},
{"type":"IC","pname":"東部湯の丸","lat":36.372617,"lng":138.347102},
{"type":"IC","pname":"上田菅平","lat":36.413413,"lng":138.283965},
{"type":"IC","pname":"坂城","lat":36.445521,"lng":138.207101},
{"type":"JCT","pname":"更埴","lat":36.552872,"lng":138.141728},
{"type":"IC","pname":"長野","lat":36.575144,"lng":138.201042},
{"type":"IC","pname":"須坂長野東","lat":36.63435,"lng":138.273497},
{"type":"IC","pname":"信州中野","lat":36.729961,"lng":138.317284},
{"type":"IC","pname":"豊田飯山","lat":36.796182,"lng":138.32157},
{"type":"IC","pname":"信濃町","lat":36.82219,"lng":138.191062},
{"type":"IC","pname":"妙高高原","lat":36.865562,"lng":138.194559},
{"type":"IC","pname":"中郷","lat":36.968971,"lng":138.221135},
{"type":"IC","pname":"上越高田","lat":37.088757,"lng":138.226},
{"type":"JCT","pname":"上越","lat":37.140109,"lng":138.2151}
];

const toukaihokuriku1 = [
{"type":"JCT","pname":"一宮","lat":35.282705,"lng":136.781003},
{"type":"IC","pname":"一宮西","lat":35.292769,"lng":136.779359},
{"type":"IC","pname":"尾西","lat":35.315158,"lng":136.77665},
{"type":"IC","pname":"一宮木曽川","lat":35.343107,"lng":136.794698},
{"type":"IC","pname":"岐阜各務原","lat":35.386931,"lng":136.817521},
{"type":"IC","pname":"関","lat":35.467032,"lng":136.891958},
{"type":"JCT","pname":"美濃関","lat":35.515714,"lng":136.901496},
{"type":"IC","pname":"美濃","lat":35.527345,"lng":136.905774},
{"type":"IC","pname":"美並","lat":35.661853,"lng":136.957838},
{"type":"IC","pname":"郡上八幡","lat":35.748465,"lng":136.944551},
{"type":"IC","pname":"ぎふ大和","lat":35.78974,"lng":136.907091},
{"type":"IC","pname":"白鳥","lat":35.872807,"lng":136.876071},
{"type":"IC","pname":"高鷲","lat":35.935858,"lng":136.879815},
{"type":"IC","pname":"荘川","lat":36.019822,"lng":136.96147},
{"type":"IC","pname":"飛騨清見","lat":36.136733,"lng":137.0789}
];

const toukaihokuriku2 = [
{"type":"IC","pname":"白川郷","lat":36.270353,"lng":136.896864},
{"type":"IC","pname":"五箇山","lat":36.391609,"lng":136.878617},
{"type":"IC","pname":"福光","lat":36.53381,"lng":136.888586},
{"type":"JCT","pname":"小矢部砺波","lat":36.63051,"lng":136.908531}
];

const douou = [
{"type":"IC","pname":"八雲","lat":42.264511,"lng":140.252924},
{"type":"IC","pname":"国縫","lat":42.439991,"lng":140.313419},
{"type":"IC","pname":"長万部","lat":42.525284,"lng":140.365215},
{"type":"IC","pname":"豊浦","lat":42.604159,"lng":140.638518},
{"type":"IC","pname":"虻田洞爺湖","lat":42.546115,"lng":140.792649},
{"type":"IC","pname":"伊達","lat":42.484221,"lng":140.893666},
{"type":"IC","pname":"室蘭","lat":42.387193,"lng":140.970351},
{"type":"IC","pname":"登別室蘭","lat":42.398805,"lng":141.080418},
{"type":"IC","pname":"登別東","lat":42.461593,"lng":141.173667},
{"type":"IC","pname":"白老","lat":42.564926,"lng":141.328876},
{"type":"IC","pname":"苫小牧西","lat":42.633201,"lng":141.49057},
{"type":"IC","pname":"苫小牧東","lat":42.709789,"lng":141.652082},
{"type":"IC","pname":"千歳","lat":42.811805,"lng":141.620851},
{"type":"JCT","pname":"千歳恵庭","lat":42.845332,"lng":141.585038},
{"type":"IC","pname":"恵庭","lat":42.87128,"lng":141.554584},
{"type":"IC","pname":"北広島","lat":42.976742,"lng":141.478495},
{"type":"IC","pname":"札幌南","lat":43.012783,"lng":141.465154},
{"type":"IC","pname":"大谷地","lat":43.042104,"lng":141.437387},
{"type":"IC","pname":"北郷","lat":43.059443,"lng":141.425224},
{"type":"JCT","pname":"札幌","lat":43.07678,"lng":141.420629},
{"type":"IC","pname":"札幌","lat":43.078335,"lng":141.424027},
{"type":"IC","pname":"江別西","lat":43.09358,"lng":141.496436},
{"type":"IC","pname":"江別東","lat":43.10488,"lng":141.599986},
{"type":"IC","pname":"岩見沢","lat":43.174483,"lng":141.76614},
{"type":"IC","pname":"三笠","lat":43.243868,"lng":141.83028},
{"type":"IC","pname":"美唄","lat":43.332992,"lng":141.888208},
{"type":"IC","pname":"奈井江砂川","lat":43.44984,"lng":141.917774},
{"type":"IC","pname":"滝川","lat":43.567692,"lng":141.954579},
{"type":"JCT","pname":"深川","lat":43.666193,"lng":142.025971},
{"type":"IC","pname":"深川","lat":43.689268,"lng":142.078398},
{"type":"IC","pname":"旭川鷹栖","lat":43.804135,"lng":142.323007},
{"type":"IC","pname":"旭川北","lat":43.837553,"lng":142.40843},
{"type":"JCT","pname":"比布","lat":43.920012,"lng":142.469204},
{"type":"IC","pname":"和寒","lat":44.009164,"lng":142.435939},
{"type":"IC","pname":"士別剣淵","lat":44.143092,"lng":142.401969}
];

const sasson = [
{"type":"IC","pname":"小樽","lat":43.181018,"lng":141.020422},
{"type":"IC","pname":"朝里","lat":43.168128,"lng":141.050109},
{"type":"IC","pname":"銭函","lat":43.13328,"lng":141.174056},
{"type":"IC","pname":"手稲","lat":43.110179,"lng":141.240151},
{"type":"IC","pname":"札幌西","lat":43.090046,"lng":141.267872},
{"type":"IC","pname":"新川","lat":43.101629,"lng":141.311144},
{"type":"IC","pname":"札幌北(1)","lat":43.100135,"lng":141.336027},
{"type":"IC","pname":"札幌北(2)","lat":43.102458,"lng":141.353705},
{"type":"IC","pname":"伏古","lat":43.097552,"lng":141.393222},
{"type":"IC","pname":"雁来","lat":43.090336,"lng":141.410769},
{"type":"JCT","pname":"札幌","lat":43.07678,"lng":141.420629}
];

const doutou1 = [
{"type":"JCT","pname":"千歳恵庭","lat":42.845332,"lng":141.585038},
{"type":"IC","pname":"千歳東","lat":42.882385,"lng":141.709827},
{"type":"IC","pname":"追分町","lat":42.892945,"lng":141.816775},
{"type":"IC","pname":"夕張","lat":42.922942,"lng":142.034994}
];

const doutou2 = [
{"type":"IC","pname":"十勝清水","lat":42.995347,"lng":142.856909},
{"type":"IC","pname":"芽室","lat":42.969297,"lng":143.04469},
{"type":"JCT","pname":"帯広","lat":42.970975,"lng":143.094558},
{"type":"IC","pname":"音更帯広","lat":42.980885,"lng":143.17956},
{"type":"IC","pname":"池田","lat":42.995345,"lng":143.436744},
{"type":"JCT","pname":"本別","lat":43.103082,"lng":143.555635},
{"type":"IC","pname":"本別","lat":43.108233,"lng":143.582232}
];

const doutou3 = [
{"type":"JCT","pname":"本別","lat":43.103082,"lng":143.555635},
{"type":"IC","pname":"足寄","lat":43.2095,"lng":143.561507}
];


const matsuyama1 = [
{"type":"JCT","pname":"川之江","lat":34.0009,"lng":133.596979},
{"type":"IC","pname":"三島川之江","lat":33.979035,"lng":133.577356},
{"type":"IC","pname":"土居","lat":33.955537,"lng":133.464414},
{"type":"IC","pname":"新居浜","lat":33.926501,"lng":133.326814},
{"type":"IC","pname":"いよ西条","lat":33.912067,"lng":133.23785},
{"type":"JCT","pname":"いよ小松","lat":33.882884,"lng":133.089092},
{"type":"IC","pname":"川内","lat":33.794395,"lng":132.90307},
{"type":"IC","pname":"松山","lat":33.795084,"lng":132.780617},
{"type":"IC","pname":"伊予","lat":33.736736,"lng":132.701629},
{"type":"IC","pname":"内子五十崎","lat":33.543959,"lng":132.652383},
{"type":"IC","pname":"大洲","lat":33.533073,"lng":132.576066}
];

const matsuyama2 = [
{"type":"IC","pname":"大洲北只","lat":33.488666,"lng":132.538137},
{"type":"IC","pname":"西予宇和","lat":33.361729,"lng":132.526094}
];

const takamatsu1 = [
{"type":"IC","pname":"鳴門","lat":34.17323,"lng":134.574462},
{"type":"IC","pname":"板野","lat":34.152771,"lng":134.473144},
{"type":"IC","pname":"引田","lat":34.226496,"lng":134.38535},
{"type":"IC","pname":"白鳥大内","lat":34.234018,"lng":134.333817},
{"type":"IC","pname":"津田東","lat":34.276266,"lng":134.276217},
{"type":"IC","pname":"津田寒川","lat":34.294337,"lng":134.226223},
{"type":"IC","pname":"志度","lat":34.308411,"lng":134.19405},
{"type":"IC","pname":"さぬき三木","lat":34.302099,"lng":134.145652},
{"type":"IC","pname":"高松東","lat":34.297978,"lng":134.114981},
{"type":"IC","pname":"高松中央","lat":34.304749,"lng":134.073986},
{"type":"IC","pname":"高松檀紙","lat":34.305947,"lng":134.00382},
{"type":"IC","pname":"高松西","lat":34.294747,"lng":133.991562},
{"type":"JCT","pname":"坂出","lat":34.281563,"lng":133.850971},
{"type":"IC","pname":"善通寺","lat":34.242515,"lng":133.78626},
{"type":"IC","pname":"三豊鳥坂","lat":34.20702,"lng":133.73105},
{"type":"IC","pname":"さぬき豊中","lat":34.148732,"lng":133.715597},
{"type":"IC","pname":"大野原","lat":34.085452,"lng":133.655492},
{"type":"JCT","pname":"川之江","lat":34.0009,"lng":133.596979}
];

const takamatsu2 = [
{"type":"JCT","pname":"坂出","lat":34.281563,"lng":133.850971},
{"type":"IC","pname":"坂出","lat":34.296059,"lng":133.844864}
];

const tokushima = [
{"type":"IC","pname":"徳島","lat":34.101058,"lng":134.574014},
{"type":"IC","pname":"藍住","lat":34.117558,"lng":134.479335},
{"type":"IC","pname":"土成","lat":34.121258,"lng":134.356155},
{"type":"IC","pname":"脇町","lat":34.076681,"lng":134.169454},
{"type":"IC","pname":"美馬","lat":34.057448,"lng":134.048441},
{"type":"IC","pname":"井川池田","lat":34.028591,"lng":133.838308},
{"type":"JCT","pname":"川之江東","lat":33.997298,"lng":133.619821}
];

const kochi = [
{"type":"JCT","pname":"川之江","lat":34.0009,"lng":133.596979},
{"type":"JCT","pname":"川之江東","lat":33.997298,"lng":133.619821},
{"type":"IC","pname":"新宮","lat":33.924108,"lng":133.63997},
{"type":"IC","pname":"大豊","lat":33.770443,"lng":133.659657},
{"type":"IC","pname":"南国","lat":33.616898,"lng":133.635756},
{"type":"IC","pname":"高知","lat":33.589744,"lng":133.565643},
{"type":"IC","pname":"伊野","lat":33.560109,"lng":133.469239},
{"type":"IC","pname":"土佐","lat":33.501854,"lng":133.415946},
{"type":"IC","pname":"須崎東","lat":33.419514,"lng":133.301775}
];


	this.array = [];

	this.array.push( toumei );
	this.array.push( chuou );
	this.array.push( meishin );
	this.array.push( higashimeihan1 );
	this.array.push( higashimeihan2 );
	this.array.push( isewangan );
	this.array.push( jyouban );
	this.array.push( banetsu );
	this.array.push( touhoku );
	this.array.push( akita );
	this.array.push( kanetsu );
	this.array.push( chugoku );
	this.array.push( sanyou1 );
	this.array.push( sanyou2 );
	this.array.push( sanyou3 );
	this.array.push( sanyou4 );
	this.array.push( sanyou5 );
	this.array.push( yonago );
	this.array.push( kyushu );
	this.array.push( ooita1 );
	this.array.push( ooita2 );
	this.array.push( nagasaki );
	this.array.push( miyazaki );
	this.array.push( hokuriku );
	this.array.push( jyoshinetsu );
	this.array.push( toukaihokuriku1 );
	this.array.push( toukaihokuriku2 );
	this.array.push( douou );
	this.array.push( sasson );
	this.array.push( doutou1 );
	this.array.push( doutou2 );
	this.array.push( doutou3 );
	this.array.push( matsuyama1 );
	this.array.push( matsuyama2 );
	this.array.push( takamatsu1 );
	this.array.push( takamatsu2 );
	this.array.push( tokushima );
	this.array.push( kochi );

	this.array.sort( _compare_lat);

	return this;

	function _compare_lat( a, b ){
		if( a.lat < b.lat ) return -1;
		if( a.lat > b.lat ) return 1;
		return 0;
	}
}
